{"config": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "name": "cropping2d_1", "cropping": [[70, 25], [0, 0]]}, "class_name": "Cropping2D"}, {"config": {"function_type": "lambda", "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>6\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 36, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 48, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "b_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_row": 5, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 64, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_row": 3, "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"output_dim": 100, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 2112, "b_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"output_dim": 50, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 100, "b_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"output_dim": 10, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 50, "b_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}, {"config": {"output_dim": 1, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": 10, "b_regularizer": null, "trainable": true, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}